-- phpMyAdmin SQL Dump
-- version 4.4.10
-- http://www.phpmyadmin.net
--
-- Хост: localhost:8889
-- Время создания: Мар 31 2017 г., 05:22
-- Версия сервера: 5.5.42
-- Версия PHP: 5.6.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";

--
-- База данных: `hostel`
--

-- --------------------------------------------------------

--
-- Структура таблицы `appointment`
--

CREATE TABLE `appointment` (
  `id` int(4) NOT NULL,
  `title` varchar(100) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=26 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `appointment`
--

INSERT INTO `appointment` (`id`, `title`) VALUES
(1, 'врач-хирург'),
(2, 'врач-анестезиолог'),
(3, 'главный врач'),
(4, 'медицинская сестра'),
(5, 'врач-стомотолог'),
(6, 'врач-педиатр'),
(7, 'директор'),
(8, 'лаборант'),
(25, 'программист');

-- --------------------------------------------------------

--
-- Структура таблицы `k_mesto`
--

CREATE TABLE `k_mesto` (
  `id` int(4) NOT NULL,
  `etaz` int(2) NOT NULL,
  `blok` int(3) NOT NULL,
  `komnata` varchar(1) NOT NULL,
  `mesto` varchar(1) NOT NULL,
  `busy` int(11) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=361 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `k_mesto`
--

INSERT INTO `k_mesto` (`id`, `etaz`, `blok`, `komnata`, `mesto`, `busy`) VALUES
(1, 1, 1, 'A', '1', 0),
(2, 1, 1, 'A', '2', 0),
(3, 1, 1, 'B', '3', 0),
(4, 1, 1, 'B', '4', 0),
(5, 1, 1, 'B', '5', 0),
(6, 1, 1, 'B', '6', 0),
(7, 1, 2, 'A', '1', 0),
(8, 1, 2, 'A', '2', 0),
(9, 1, 2, 'B', '3', 0),
(10, 1, 2, 'B', '4', 0),
(11, 1, 2, 'B', '5', 0),
(12, 1, 2, 'B', '6', 0),
(13, 1, 3, 'A', '1', 0),
(14, 1, 3, 'A', '2', 0),
(15, 1, 3, 'B', '3', 0),
(16, 1, 3, 'B', '4', 0),
(17, 1, 3, 'B', '5', 0),
(18, 1, 3, 'B', '6', 0),
(19, 1, 4, 'A', '1', 0),
(20, 1, 4, 'A', '2', 0),
(21, 1, 4, 'B', '3', 0),
(22, 1, 4, 'B', '4', 0),
(23, 1, 4, 'B', '5', 0),
(24, 1, 4, 'B', '6', 0),
(25, 1, 5, 'A', '1', 0),
(26, 1, 5, 'A', '2', 0),
(27, 1, 5, 'B', '3', 0),
(28, 1, 5, 'B', '4', 0),
(29, 1, 5, 'B', '5', 0),
(30, 1, 5, 'B', '6', 0),
(31, 1, 6, 'A', '1', 0),
(32, 1, 6, 'A', '2', 0),
(33, 1, 6, 'B', '3', 0),
(34, 1, 6, 'B', '4', 0),
(35, 1, 6, 'B', '5', 0),
(36, 1, 6, 'B', '6', 0),
(37, 1, 7, 'A', '1', 0),
(38, 1, 7, 'A', '2', 0),
(39, 1, 7, 'B', '3', 0),
(40, 1, 7, 'B', '4', 0),
(41, 1, 7, 'B', '5', 0),
(42, 1, 7, 'B', '6', 0),
(43, 1, 8, 'A', '1', 0),
(44, 1, 8, 'A', '2', 0),
(45, 1, 8, 'B', '3', 0),
(46, 1, 8, 'B', '4', 0),
(47, 1, 8, 'B', '5', 0),
(48, 1, 8, 'B', '6', 0),
(49, 1, 9, 'A', '1', 0),
(50, 1, 9, 'A', '2', 0),
(51, 1, 9, 'B', '3', 0),
(52, 1, 9, 'B', '4', 0),
(53, 1, 9, 'B', '5', 0),
(54, 1, 9, 'B', '6', 0),
(55, 1, 10, 'A', '1', 0),
(56, 1, 10, 'A', '2', 0),
(57, 1, 10, 'B', '3', 0),
(58, 1, 10, 'B', '4', 0),
(59, 1, 10, 'B', '5', 0),
(60, 1, 10, 'B', '6', 0),
(61, 2, 11, 'A', '1', 0),
(62, 2, 11, 'A', '2', 0),
(63, 2, 11, 'B', '3', 0),
(64, 2, 11, 'B', '4', 0),
(65, 2, 11, 'B', '5', 0),
(66, 2, 11, 'B', '6', 0),
(67, 2, 12, 'A', '1', 0),
(68, 2, 12, 'A', '2', 0),
(69, 2, 12, 'B', '3', 0),
(70, 2, 12, 'B', '4', 0),
(71, 2, 12, 'B', '5', 0),
(72, 2, 12, 'B', '6', 0),
(73, 2, 13, 'A', '1', 0),
(74, 2, 13, 'A', '2', 0),
(75, 2, 13, 'B', '3', 0),
(76, 2, 13, 'B', '4', 0),
(77, 2, 13, 'B', '5', 0),
(78, 2, 13, 'B', '6', 0),
(79, 2, 14, 'A', '1', 0),
(80, 2, 14, 'A', '2', 0),
(81, 2, 14, 'B', '3', 0),
(82, 2, 14, 'B', '4', 0),
(83, 2, 14, 'B', '5', 0),
(84, 2, 14, 'B', '6', 0),
(85, 2, 15, 'A', '1', 0),
(86, 2, 15, 'A', '2', 0),
(87, 2, 15, 'B', '3', 0),
(88, 2, 15, 'B', '4', 0),
(89, 2, 15, 'B', '5', 0),
(90, 2, 15, 'B', '6', 0),
(91, 2, 16, 'A', '1', 0),
(92, 2, 16, 'A', '2', 0),
(93, 2, 16, 'B', '3', 0),
(94, 2, 16, 'B', '4', 0),
(95, 2, 16, 'B', '5', 0),
(96, 2, 16, 'B', '6', 0),
(97, 2, 17, 'A', '1', 0),
(98, 2, 17, 'A', '2', 0),
(99, 2, 17, 'B', '3', 0),
(100, 2, 17, 'B', '4', 0),
(101, 2, 17, 'B', '5', 0),
(102, 2, 17, 'B', '6', 0),
(103, 2, 18, 'A', '1', 0),
(104, 2, 18, 'A', '2', 0),
(105, 2, 18, 'B', '3', 0),
(106, 2, 18, 'B', '4', 0),
(107, 2, 18, 'B', '5', 0),
(108, 2, 18, 'B', '6', 0),
(109, 2, 19, 'A', '1', 0),
(110, 2, 19, 'A', '2', 0),
(111, 2, 19, 'B', '3', 0),
(112, 2, 19, 'B', '4', 0),
(113, 2, 19, 'B', '5', 0),
(114, 2, 19, 'B', '6', 0),
(115, 2, 20, 'A', '1', 0),
(116, 2, 20, 'A', '2', 0),
(117, 2, 20, 'B', '3', 0),
(118, 2, 20, 'B', '4', 0),
(119, 2, 20, 'B', '5', 0),
(120, 2, 20, 'B', '6', 0),
(121, 3, 21, 'A', '1', 0),
(122, 3, 21, 'A', '2', 0),
(123, 3, 21, 'B', '3', 0),
(124, 3, 21, 'B', '4', 0),
(125, 3, 21, 'B', '5', 0),
(126, 3, 21, 'B', '6', 0),
(127, 3, 22, 'A', '1', 0),
(128, 3, 22, 'A', '2', 0),
(129, 3, 22, 'B', '3', 0),
(130, 3, 22, 'B', '4', 0),
(131, 3, 22, 'B', '5', 0),
(132, 3, 22, 'B', '6', 0),
(133, 3, 23, 'A', '1', 0),
(134, 3, 23, 'A', '2', 0),
(135, 3, 23, 'B', '3', 0),
(136, 3, 23, 'B', '4', 0),
(137, 3, 23, 'B', '5', 0),
(138, 3, 23, 'B', '6', 0),
(139, 3, 24, 'A', '1', 0),
(140, 3, 24, 'A', '2', 0),
(141, 3, 24, 'B', '3', 0),
(142, 3, 24, 'B', '4', 0),
(143, 3, 24, 'B', '5', 0),
(144, 3, 24, 'B', '6', 0),
(145, 3, 25, 'A', '1', 0),
(146, 3, 25, 'A', '2', 0),
(147, 3, 25, 'B', '3', 0),
(148, 3, 25, 'B', '4', 0),
(149, 3, 25, 'B', '5', 0),
(150, 3, 25, 'B', '6', 0),
(151, 3, 26, 'A', '1', 0),
(152, 3, 26, 'A', '2', 0),
(153, 3, 26, 'B', '3', 0),
(154, 3, 26, 'B', '4', 0),
(155, 3, 26, 'B', '5', 0),
(156, 3, 26, 'B', '6', 0),
(157, 3, 27, 'A', '1', 0),
(158, 3, 27, 'A', '2', 0),
(159, 3, 27, 'B', '3', 0),
(160, 3, 27, 'B', '4', 0),
(161, 3, 27, 'B', '5', 0),
(162, 3, 27, 'B', '6', 0),
(163, 3, 28, 'A', '1', 0),
(164, 3, 28, 'A', '2', 0),
(165, 3, 28, 'B', '3', 0),
(166, 3, 28, 'B', '4', 0),
(167, 3, 28, 'B', '5', 0),
(168, 3, 28, 'B', '6', 0),
(169, 3, 29, 'A', '1', 0),
(170, 3, 29, 'A', '2', 0),
(171, 3, 29, 'B', '3', 0),
(172, 3, 29, 'B', '4', 0),
(173, 3, 29, 'B', '5', 0),
(174, 3, 29, 'B', '6', 0),
(175, 3, 30, 'A', '1', 0),
(176, 3, 30, 'A', '2', 0),
(177, 3, 30, 'B', '3', 0),
(178, 3, 30, 'B', '4', 0),
(179, 3, 30, 'B', '5', 0),
(180, 3, 30, 'B', '6', 0),
(181, 4, 31, 'A', '1', 0),
(182, 4, 31, 'A', '2', 0),
(183, 4, 31, 'B', '3', 0),
(184, 4, 31, 'B', '4', 0),
(185, 4, 31, 'B', '5', 0),
(186, 4, 31, 'B', '6', 0),
(187, 4, 32, 'A', '1', 0),
(188, 4, 32, 'A', '2', 0),
(189, 4, 32, 'B', '3', 0),
(190, 4, 32, 'B', '4', 0),
(191, 4, 32, 'B', '5', 0),
(192, 4, 32, 'B', '6', 0),
(193, 4, 33, 'A', '1', 0),
(194, 4, 33, 'A', '2', 0),
(195, 4, 33, 'B', '3', 0),
(196, 4, 33, 'B', '4', 0),
(197, 4, 33, 'B', '5', 0),
(198, 4, 33, 'B', '6', 0),
(199, 4, 34, 'A', '1', 0),
(200, 4, 34, 'A', '2', 0),
(201, 4, 34, 'B', '3', 0),
(202, 4, 34, 'B', '4', 0),
(203, 4, 34, 'B', '5', 0),
(204, 4, 34, 'B', '6', 0),
(205, 4, 35, 'A', '1', 0),
(206, 4, 35, 'A', '2', 0),
(207, 4, 35, 'B', '3', 0),
(208, 4, 35, 'B', '4', 0),
(209, 4, 35, 'B', '5', 0),
(210, 4, 35, 'B', '6', 0),
(211, 4, 36, 'A', '1', 0),
(212, 4, 36, 'A', '2', 0),
(213, 4, 36, 'B', '3', 0),
(214, 4, 36, 'B', '4', 0),
(215, 4, 36, 'B', '5', 0),
(216, 4, 36, 'B', '6', 0),
(217, 4, 37, 'A', '1', 0),
(218, 4, 37, 'A', '2', 0),
(219, 4, 37, 'B', '3', 0),
(220, 4, 37, 'B', '4', 0),
(221, 4, 37, 'B', '5', 0),
(222, 4, 37, 'B', '6', 0),
(223, 4, 38, 'A', '1', 0),
(224, 4, 38, 'A', '2', 0),
(225, 4, 38, 'B', '3', 0),
(226, 4, 38, 'B', '4', 0),
(227, 4, 38, 'B', '5', 0),
(228, 4, 38, 'B', '6', 0),
(229, 4, 39, 'A', '1', 0),
(230, 4, 39, 'A', '2', 0),
(231, 4, 39, 'B', '3', 0),
(232, 4, 39, 'B', '4', 0),
(233, 4, 39, 'B', '5', 0),
(234, 4, 39, 'B', '6', 0),
(235, 4, 40, 'A', '1', 0),
(236, 4, 40, 'A', '2', 0),
(237, 4, 40, 'B', '3', 0),
(238, 4, 40, 'B', '4', 0),
(239, 4, 40, 'B', '5', 0),
(240, 4, 40, 'B', '6', 0),
(241, 5, 41, 'A', '1', 0),
(242, 5, 41, 'A', '2', 0),
(243, 5, 41, 'B', '3', 0),
(244, 5, 41, 'B', '4', 0),
(245, 5, 41, 'B', '5', 0),
(246, 5, 41, 'B', '6', 0),
(247, 5, 42, 'A', '1', 0),
(248, 5, 42, 'A', '2', 0),
(249, 5, 42, 'B', '3', 0),
(250, 5, 42, 'B', '4', 0),
(251, 5, 42, 'B', '5', 0),
(252, 5, 42, 'B', '6', 0),
(253, 5, 43, 'A', '1', 0),
(254, 5, 43, 'A', '2', 0),
(255, 5, 43, 'B', '3', 0),
(256, 5, 43, 'B', '4', 0),
(257, 5, 43, 'B', '5', 0),
(258, 5, 43, 'B', '6', 0),
(259, 5, 44, 'A', '1', 0),
(260, 5, 44, 'A', '2', 0),
(261, 5, 44, 'B', '3', 0),
(262, 5, 44, 'B', '4', 0),
(263, 5, 44, 'B', '5', 0),
(264, 5, 44, 'B', '6', 0),
(265, 5, 45, 'A', '1', 0),
(266, 5, 45, 'A', '2', 0),
(267, 5, 45, 'B', '3', 0),
(268, 5, 45, 'B', '4', 0),
(269, 5, 45, 'B', '5', 0),
(270, 5, 45, 'B', '6', 0),
(271, 5, 46, 'A', '1', 0),
(272, 5, 46, 'A', '2', 0),
(273, 5, 46, 'B', '3', 0),
(274, 5, 46, 'B', '4', 0),
(275, 5, 46, 'B', '5', 0),
(276, 5, 46, 'B', '6', 0),
(277, 5, 47, 'A', '1', 0),
(278, 5, 47, 'A', '2', 0),
(279, 5, 47, 'B', '3', 0),
(280, 5, 47, 'B', '4', 0),
(281, 5, 47, 'B', '5', 0),
(282, 5, 47, 'B', '6', 0),
(283, 5, 48, 'A', '1', 0),
(284, 5, 48, 'A', '2', 0),
(285, 5, 48, 'B', '3', 0),
(286, 5, 48, 'B', '4', 0),
(287, 5, 48, 'B', '5', 0),
(288, 5, 48, 'B', '6', 0),
(289, 5, 49, 'A', '1', 0),
(290, 5, 49, 'A', '2', 0),
(291, 5, 49, 'B', '3', 0),
(292, 5, 49, 'B', '4', 0),
(293, 5, 49, 'B', '5', 0),
(294, 5, 49, 'B', '6', 0),
(295, 5, 50, 'A', '1', 0),
(296, 5, 50, 'A', '2', 0),
(297, 5, 50, 'B', '3', 0),
(298, 5, 50, 'B', '4', 0),
(299, 5, 50, 'B', '5', 0),
(300, 5, 50, 'B', '6', 0),
(301, 6, 51, 'A', '1', 0),
(302, 6, 51, 'A', '2', 0),
(303, 6, 51, 'B', '3', 0),
(304, 6, 51, 'B', '4', 0),
(305, 6, 51, 'B', '5', 0),
(306, 6, 51, 'B', '6', 0),
(307, 6, 52, 'A', '1', 0),
(308, 6, 52, 'A', '2', 0),
(309, 6, 52, 'B', '3', 0),
(310, 6, 52, 'B', '4', 0),
(311, 6, 52, 'B', '5', 0),
(312, 6, 52, 'B', '6', 0),
(313, 6, 53, 'A', '1', 0),
(314, 6, 53, 'A', '2', 0),
(315, 6, 53, 'B', '3', 0),
(316, 6, 53, 'B', '4', 0),
(317, 6, 53, 'B', '5', 0),
(318, 6, 53, 'B', '6', 0),
(319, 6, 54, 'A', '1', 0),
(320, 6, 54, 'A', '2', 0),
(321, 6, 54, 'B', '3', 0),
(322, 6, 54, 'B', '4', 0),
(323, 6, 54, 'B', '5', 0),
(324, 6, 54, 'B', '6', 0),
(325, 6, 55, 'A', '1', 0),
(326, 6, 55, 'A', '2', 0),
(327, 6, 55, 'B', '3', 0),
(328, 6, 55, 'B', '4', 0),
(329, 6, 55, 'B', '5', 0),
(330, 6, 55, 'B', '6', 0),
(331, 6, 56, 'A', '1', 0),
(332, 6, 56, 'A', '2', 0),
(333, 6, 56, 'B', '3', 0),
(334, 6, 56, 'B', '4', 0),
(335, 6, 56, 'B', '5', 0),
(336, 6, 56, 'B', '6', 0),
(337, 6, 57, 'A', '1', 0),
(338, 6, 57, 'A', '2', 0),
(339, 6, 57, 'B', '3', 0),
(340, 6, 57, 'B', '4', 0),
(341, 6, 57, 'B', '5', 0),
(342, 6, 57, 'B', '6', 0),
(343, 6, 58, 'A', '1', 0),
(344, 6, 58, 'A', '2', 0),
(345, 6, 58, 'B', '3', 0),
(346, 6, 58, 'B', '4', 0),
(347, 6, 58, 'B', '5', 0),
(348, 6, 58, 'B', '6', 0),
(349, 6, 59, 'A', '1', 0),
(350, 6, 59, 'A', '2', 0),
(351, 6, 59, 'B', '3', 0),
(352, 6, 59, 'B', '4', 0),
(353, 6, 59, 'B', '5', 0),
(354, 6, 59, 'B', '6', 0),
(355, 6, 60, 'A', '1', 0),
(356, 6, 60, 'A', '2', 0),
(357, 6, 60, 'B', '3', 0),
(358, 6, 60, 'B', '4', 0),
(359, 6, 60, 'B', '5', 0),
(360, 6, 60, 'B', '6', 0);

-- --------------------------------------------------------

--
-- Структура таблицы `nationality`
--

CREATE TABLE `nationality` (
  `id` int(3) NOT NULL,
  `title` varchar(100) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `nationality`
--

INSERT INTO `nationality` (`id`, `title`) VALUES
(1, 'Беларусь'),
(2, 'Украина'),
(3, 'Ливан'),
(4, 'Сирия'),
(5, 'Казахстан'),
(6, 'Литва'),
(7, 'Россия'),
(8, 'Грузия');

-- --------------------------------------------------------

--
-- Структура таблицы `projivanie`
--

CREATE TABLE `projivanie` (
  `id` int(11) NOT NULL,
  `date_start` date NOT NULL,
  `id_visitor` int(11) NOT NULL,
  `id_k_mesto` int(11) NOT NULL,
  `date_finish` date NOT NULL,
  `payment` int(11) NOT NULL,
  `note` varchar(100) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=54 DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `roles`
--

CREATE TABLE `roles` (
  `id` int(11) NOT NULL,
  `title` varchar(20) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `roles`
--

INSERT INTO `roles` (`id`, `title`) VALUES
(1, 'заведующий'),
(2, 'администратор'),
(3, 'проректор');

-- --------------------------------------------------------

--
-- Структура таблицы `sex`
--

CREATE TABLE `sex` (
  `id` int(1) NOT NULL,
  `title` varchar(3) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `sex`
--

INSERT INTO `sex` (`id`, `title`) VALUES
(1, 'муж'),
(2, 'жен');

-- --------------------------------------------------------

--
-- Структура таблицы `Users`
--

CREATE TABLE `Users` (
  `id` int(11) NOT NULL,
  `login` varchar(20) NOT NULL,
  `password` varchar(20) NOT NULL,
  `id_role` int(11) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `Users`
--

INSERT INTO `Users` (`id`, `login`, `password`, `id_role`) VALUES
(1, 'admin', '1234', 1),
(2, 'zaved', '4321', 2),
(3, 'prorector', '5678', 3);

-- --------------------------------------------------------

--
-- Структура таблицы `visitor`
--

CREATE TABLE `visitor` (
  `id` int(6) NOT NULL,
  `f_name` varchar(50) NOT NULL,
  `m_name` varchar(50) NOT NULL,
  `surname` varchar(50) NOT NULL,
  `date_birthday` date NOT NULL,
  `appointment` varchar(50) NOT NULL,
  `work_place` int(11) NOT NULL,
  `passport_series` varchar(11) NOT NULL,
  `passport_number` int(11) NOT NULL,
  `personal_number` varchar(30) NOT NULL,
  `date_issue` date NOT NULL,
  `Autority` varchar(150) NOT NULL,
  `Registration_place` varchar(150) NOT NULL,
  `Registration_adress` varchar(100) NOT NULL,
  `Sex` int(11) NOT NULL,
  `Nationality` int(11) NOT NULL
) ENGINE=MyISAM AUTO_INCREMENT=36 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `visitor`
--

INSERT INTO `visitor` (`id`, `f_name`, `m_name`, `surname`, `date_birthday`, `appointment`, `work_place`, `passport_series`, `passport_number`, `personal_number`, `date_issue`, `Autority`, `Registration_place`, `Registration_adress`, `Sex`, `Nationality`) VALUES
(32, 'Кирилл', 'Товпинец', 'Александрович', '1994-02-10', '1', 1, 'ВМ', 1770368, '3100294E006PB9', '2019-02-10', 'aaaaaa', 'Минск', 'пр. Пушкина 29, кв. 137', 1, 1),
(33, 'Михаил', 'Степнов', 'Александрович', '2017-03-16', '1', 1, 'ВМ', 1770368, '3100294E006PB9', '2017-04-05', 'aaaaaa', 'Минск', 'пр. Пушкина 29, кв. 137', 1, 1),
(34, 'Андрей', 'Новиков', 'Александрович', '2010-09-16', '1', 1, 'ВМ', 1770368, '3100294E006PB9', '2017-04-05', 'aaaaaa', 'Минск', 'пр. Пушкина 29, кв. 137', 1, 1),
(35, 'Андрей', 'Товпинец', 'Александрович', '1994-02-10', '1', 1, 'ВМ', 1770368, '3100294E006PB9', '2019-02-10', 'aaaaaa', 'Минск', 'пр. Пушкина 29, кв. 137', 1, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `work_place`
--

CREATE TABLE `work_place` (
  `id` int(5) NOT NULL,
  `title` varchar(250) NOT NULL,
  `city` varchar(100) NOT NULL,
  `region` varchar(50) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `work_place`
--

INSERT INTO `work_place` (`id`, `title`, `city`, `region`) VALUES
(1, '1-я городская клиническая больница', 'Минск', 'Минск'),
(2, '33-я студенческая поликлиника', 'Минск', 'Минск'),
(3, '4-я городская клиническая больница', 'Минск', 'Минск'),
(4, 'Гродненская областная клиническая больница', 'Гродно', 'Гродненская');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `appointment`
--
ALTER TABLE `appointment`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `k_mesto`
--
ALTER TABLE `k_mesto`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `nationality`
--
ALTER TABLE `nationality`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `projivanie`
--
ALTER TABLE `projivanie`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `roles`
--
ALTER TABLE `roles`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `sex`
--
ALTER TABLE `sex`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `Users`
--
ALTER TABLE `Users`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `visitor`
--
ALTER TABLE `visitor`
  ADD PRIMARY KEY (`id`),
  ADD KEY `appointment` (`appointment`),
  ADD KEY `appointment_2` (`appointment`),
  ADD KEY `appointment_3` (`appointment`),
  ADD KEY `appointment_4` (`appointment`),
  ADD FULLTEXT KEY `ft1` (`f_name`,`m_name`,`surname`);
ALTER TABLE `visitor`
  ADD FULLTEXT KEY `ft2` (`f_name`);
ALTER TABLE `visitor`
  ADD FULLTEXT KEY `ft3` (`m_name`);
ALTER TABLE `visitor`
  ADD FULLTEXT KEY `ft4` (`surname`);

--
-- Индексы таблицы `work_place`
--
ALTER TABLE `work_place`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `appointment`
--
ALTER TABLE `appointment`
  MODIFY `id` int(4) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=26;
--
-- AUTO_INCREMENT для таблицы `k_mesto`
--
ALTER TABLE `k_mesto`
  MODIFY `id` int(4) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=361;
--
-- AUTO_INCREMENT для таблицы `nationality`
--
ALTER TABLE `nationality`
  MODIFY `id` int(3) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=9;
--
-- AUTO_INCREMENT для таблицы `projivanie`
--
ALTER TABLE `projivanie`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=54;
--
-- AUTO_INCREMENT для таблицы `roles`
--
ALTER TABLE `roles`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=4;
--
-- AUTO_INCREMENT для таблицы `sex`
--
ALTER TABLE `sex`
  MODIFY `id` int(1) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=3;
--
-- AUTO_INCREMENT для таблицы `Users`
--
ALTER TABLE `Users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=4;
--
-- AUTO_INCREMENT для таблицы `visitor`
--
ALTER TABLE `visitor`
  MODIFY `id` int(6) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=36;
--
-- AUTO_INCREMENT для таблицы `work_place`
--
ALTER TABLE `work_place`
  MODIFY `id` int(5) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=5;